Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/government_in_ireland/national_government/the_irish_government/the_government_introduction.html.txt.tmx
Source language: en
Languages: ga

source: The Government is the group of senior ministers responsible for the executive power of the State
ga: Grúpa Airí sinsearacha atá sa Rialtas atá freagrach as cumhacht fheidhmeannach an Stáit

source: This means that the Government is responsible for giving effect to laws
ga: Ciallaíonn sé seo go gcaithfidh an Rialtas dlíthe na tíre a chur i bhfeidhm

source: You can view this list of current Government Ministers
ga: Tá liosta Airí Rialtais ar fáil anseo

source: The Government is also often described as the Cabinet or the Executive
ga: Úsáidtear an téarma Comh-aireacht nó Coiste Gnóthaí anois agus arís nuair a bhíonn an Rialtas i gceist

source: The Government decides major questions of policy and carries out a number of different and important functions
ga: Déanann an Rialtas cinneadh maidir le polasaithe agus bíonn freagrachtaí tábhachtacha eile orthu freisin

source: You can read more information in our documents, The Government and Dáil Eireann and Composition of the Government
ga: Tá tuilleadh faisnéise ar fáil inár ndoiciméad, An Rialtas agus Dáil Éireann agus Comhdhéanamh an Rialtais
